---
kind: event
id: E:Autodesk.Revit.UI.TextBox.EnterPressed
source: html/7401a1cf-5dd6-f1ca-3cae-3ab5acf5f2ac.htm
---
# Autodesk.Revit.UI.TextBox.EnterPressed Event

Subscribe to this event to be notified when the Enter button is pressed in the text box.

## Syntax (C#)
```csharp
public event EventHandler<TextBoxEnterPressedEventArgs> EnterPressed
```